PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_pwm.h
/***************************************************************************//**
* \file cy_tcpwm_pwm.h
* \version 1.80
*
* \brief
* The header file of the TCPWM PWM driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#if !defined(CY_TCPWM_PWM_H)
#define CY_TCPWM_PWM_H

#include "cy_tcpwm.h"

#ifdef CY_IP_MXTCPWM

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_tcpwm_pwm
* Driver API for PWM.
*
* The functions and other declarations used in this part of the driver are in cy_tcpwm_pwm.h.
* You can also include cy_pdl.h to get access to all
* functions and declarations in the PDL.
*
* Use PWM mode when an output square wave is needed with a specific
* period and duty cycle, such as:
* * Creating arbitrary square wave outputs
* * Driving an LED (changing the brightness)
* * Driving Motors (dead time assertion available)
*
* The PWM has the following features:
* * 16- or 32-bit Counter.
* * Two Programmable Period registers that can be swapped.
* * Two Output Compare registers that can be swapped on overflow and/or
* underflow.
* * Left Aligned, Right Aligned, Center Aligned, and Asymmetric Aligned modes
* * Continuous or One Shot run modes.
* * Pseudo Random mode.
* * Two PWM outputs with Dead Time insertion, and programmable polarity.
* * Interrupt on Terminal Count and Compare or Capture 0. Interrupt on Compare or Capture 1 is only available in TCPWM Version 2.
* * Start, Reload, Stop, Swap (Capture), and Count Inputs.
* * Immediate Kill, Kill 0 Input, Kill 1 Input, PWM output on Disable, PWM outputs, PWM Dead Time Clocks,
* Taps Enabled. All these features are only available in TCPWM Version 2.
* * Multiple Components can be synchronized together for applications.
* such as three phase motor control.
* * Two programmable trigger outputs, trig_out0 and trig_out1 that generate a
* trigger on one of the following events Overflow, Underflow, Terminal Count,
* Compare Match 0/1, and PWM output. The available triggers are dependent on the PWM mode.
* All these features are only available in TCPWM Version 2.
* * Overflow, Underflow, and Compare(cc_match) trigger outputs are only available in TCPWM Version 1.
* * Second Compare Match (CC_MATCH1) event is only available in TCPWM Version 2.
*
* \section group_tcpwm_pwm_configuration Configuration Considerations
*
* The PWM configuration can be divided to number of sequential
* steps listed below:
* * \ref group_tcpwm_pwm_config
* * \ref group_tcpwm_pwm_clock
* * \ref group_tcpwm_pwm_enable
* * \ref group_tcpwm_pwm_start
*
* \subsection group_tcpwm_pwm_config Configure PWM
* To configure PWM, provide the configuration parameters in the
* \ref cy_stc_tcpwm_pwm_config_t structure. The Configuration structure
* can be modified through software, but if the configurator in ModusToolbox is used
* then the configuration structure will be updated with the users input. To initialize
* the driver, call \ref Cy_TCPWM_PWM_Init function providing a pointer to the populated
* \ref cy_stc_tcpwm_pwm_config_t structure.
*
* For TCPWM V1 Configuration
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_V1_PWM_Init
*
* For TCPWM V2 Configuration
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_V2_PWM_Init
*
* \subsection group_tcpwm_pwm_clock Assign Clock Divider
* The clock source must be connected to proper working.
* Any of the peripheral clock dividers could be used. Use the
* \ref group_sysclk driver API to do that.
*
* \subsection group_tcpwm_pwm_enable Enable PWM
* PWM has to be enabled before starting
*
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_PWM_Enable
*
* \subsection group_tcpwm_pwm_start Start PWM
* PWM has to be started
*
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_PWM_Start
* \{
*/

/**
* \defgroup group_tcpwm_macros_pwm          Macros
* \defgroup group_tcpwm_functions_pwm       Functions
* \defgroup group_tcpwm_data_structures_pwm Data Structures
* \} */

/**
* \addtogroup group_tcpwm_data_structures_pwm
* \{
*/
#if defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN)
/** TCPWM Dithering  */
typedef enum
{
    CY_TCPWM_DITHERING_DISABLE        = 0UL,   /**< TCPWM dithering is disabled */
    CY_TCPWM_DITHERING_PERIOD         = 1UL,   /**< TCPWM dithering is set to period */
    CY_TCPWM_DITHERING_DUTY           = 2UL,   /**< TCPWM dithering is set to duty */
    CY_TCPWM_DITHERING_PERIOD_DUTY    = 3UL,   /**< TCPWM dithering is set to period and duty */
} cy_en_tcpwm_dithering_t ;

/** TCPWM dithering limiter values */
typedef enum
{
    CY_TCPWM_DITHERING_LIMITER_1           = 1UL,   /**< TCPWM dithering limiter value 1. */
    CY_TCPWM_DITHERING_LIMITER_2           = 2UL,   /**< TCPWM dithering limiter value 2. */
    CY_TCPWM_DITHERING_LIMITER_3           = 3UL,   /**< TCPWM dithering limiter value 3. */
    CY_TCPWM_DITHERING_LIMITER_4           = 4UL,   /**< TCPWM dithering limiter value 4. */
    CY_TCPWM_DITHERING_LIMITER_5           = 5UL,   /**< TCPWM dithering limiter value 5. */
    CY_TCPWM_DITHERING_LIMITER_6           = 6UL,   /**< TCPWM dithering limiter value 6. */
    CY_TCPWM_DITHERING_LIMITER_7           = 7UL,   /**< TCPWM dithering limiter value 7. */
} cy_en_dithering_limiter_t;

/** HRPWM Operation Frequency
    Selects the frequency of operation of HRPWM feature. Micro tick is adjusted based on this information. These bits specifies the frequency of CLK_OUT from TCPWM counter. CLK_OUT = CLK_PERI = CLK_HF */
typedef enum
{
    CY_TCPWM_HRPWM_FREQ_80MHZ_OR_100MHZ          = 0UL,   /**< HRPWM Input Frequency is 80  MHz or 100 MHz  */
    CY_TCPWM_HRPWM_FREQ_160MHZ_OR_180MHZ         = 1UL,   /**< HRPWM Input Frequency is 160 MHz or 180 MHz */
    CY_TCPWM_HRPWM_FREQ_200MHZ_OR_240MHZ         = 2UL,   /**< HRPWM Input Frequency is 200 MHz or 240 MHz  */
} cy_en_hrpwm_operating_frequency_t;

/**  Specifies the behavior of the PWM outputs line_out and line_out_compl_out while the TCPWM counter is disabled or stopped. */
typedef enum
{
    CY_TCPWM_LINEOUT_AND_LINECMPOUT_IS_LOW           = 0UL,   /**< Line Out and Line Compl Out is Low during the kill and counter is disabled. */
    CY_TCPWM_LINEOUT_IS_HIGH_AND_LINECMPOUT_IS_LOW   = 1UL,   /**< Line Out is High during the kill and counter is disabled. */
    CY_TCPWM_LINECMPOUT_IS_HIGH_LINEOUT_IS_LOW       = 2UL,   /**< Line Compl Out is High during the kill and counter is disabled. */
    CY_TCPWM_LINEOUT_AND_LINECMPOUT_IS_HIGH          = 3UL,   /**< Line Out and Line Compl Out is Hig during the kill and counter is disabled. */
} cy_en_kill_line_polarity_t;
