PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_pwm.h
}

#if (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_PWMDeadTimeN
****************************************************************************//**
*
* Writes the dead time value for PWM. This is the number of clock cycles of dead time to activate Line Compliment Out
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param deadTime
* The dead time value.
*
* \funcusage
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_PWM_PWMDeadTime
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_PWMDeadTimeN(TCPWM_Type const *base, uint32_t cntNum, uint32_t deadTime)
{
    uint32_t result;
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);

    result = TCPWM_GRP_CNT_DT(base, grp, cntNum);
    result &= ~(TCPWM_GRP_CNT_V2_DT_DT_LINE_COMPL_OUT_Msk);

    TCPWM_GRP_CNT_DT(base, grp, cntNum) = result |
                                          _VAL2FLD(TCPWM_GRP_CNT_V2_DT_DT_LINE_COMPL_OUT, (uint16_t)(deadTime));

}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_SetDT
****************************************************************************//**
*
* Writes the dead time value for PWM. This is the number of clock cycles of dead time to activate Line Out and  Line Compliment Out
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param deadTime
* The dead time value for both Line Out and Line Compliment Out.
*
* \note 32 bit value with 0-15 bits to set Line out Dead Time value and 16-31 bits to set Line Compliment Out Dead Time Value.
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_SetDT(TCPWM_Type const *base, uint32_t cntNum, uint32_t deadTime)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);
    TCPWM_GRP_CNT_DT(base, grp, cntNum) = deadTime;
}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_Configure_LineSelect
****************************************************************************//**
*
* Configures the source for the output signal "line_out"  and "line_compl_out"
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param line_out_val
* Source for the lie out signal \ref cy_en_line_select_config_t
*
* \param line_compl_value
* Source for the lie compl out signal \ref cy_en_line_select_config_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_Configure_LineSelect(TCPWM_Type *base, uint32_t cntNum,  cy_en_line_select_config_t line_out_val, cy_en_line_select_config_t line_compl_value)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);
    TCPWM_GRP_CNT_LINE_SEL(base, grp, cntNum) = (_VAL2FLD(TCPWM_GRP_CNT_V2_LINE_SEL_OUT_SEL, line_out_val) |
        _VAL2FLD(TCPWM_GRP_CNT_V2_LINE_SEL_COMPL_OUT_SEL, line_compl_value));
}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_Configure_LineSelectBuff
****************************************************************************//**
*
* Buffer for LINE SELCT. Can be exchanged with Line Select values on a terminal count event with an actively pending switch event.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param line_out_val
* Source for the lie out signal \ref cy_en_line_select_config_t
*
* \param line_compl_value
* Source for the lie compl out signal \ref cy_en_line_select_config_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_Configure_LineSelectBuff(TCPWM_Type *base, uint32_t cntNum,  cy_en_line_select_config_t line_out_val, cy_en_line_select_config_t line_compl_value)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);
    TCPWM_GRP_CNT_LINE_SEL_BUFF(base, grp, cntNum) = (_VAL2FLD(TCPWM_GRP_CNT_V2_LINE_SEL_BUFF_OUT_SEL, line_out_val) |
        _VAL2FLD(TCPWM_GRP_CNT_V2_LINE_SEL_BUFF_COMPL_OUT_SEL, line_compl_value));
}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_EnableLineSelectSwap
****************************************************************************//**
*
* Enables a Line Select swap on OV and/or UN, depending on the PWM alignment
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param enable
* true = swap enabled; false = swap disabled
*
* \note From Version 3 of TCPWM, this feature is coupled with the swap enable feature (Cy_TCPWM_PWM_EnableSwap()).
* when both reload and swap are enabled then line select value is swapped with line select buff value.
* When only reload is enabled then line select buff value is copied to line select.
* There is no action when reload is disabled.
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_EnableLineSelectSwap(TCPWM_Type *base, uint32_t cntNum,  bool enable)
{
    if (enable)
    {
        TCPWM_GRP_CNT_CTRL(base, TCPWM_GRP_CNT_GET_GRP(cntNum), cntNum) |=
            TCPWM_GRP_CNT_V2_CTRL_AUTO_RELOAD_LINE_SEL_Msk;
    }
    else
    {
        TCPWM_GRP_CNT_CTRL(base, TCPWM_GRP_CNT_GET_GRP(cntNum), cntNum) &=
            ~TCPWM_GRP_CNT_V2_CTRL_AUTO_RELOAD_LINE_SEL_Msk;
    }
}
#endif

#if defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_EnableSwap
****************************************************************************//**
*
* Enables/disables swapping mechanism between CC0 and buffered CC0, CC1 and buffered CC1, PERIOD and buffered PERIOD, DT and buffered DT.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param enable
* true = swap enabled; false = swap disabled
*
* \note This feature is coupled with the reload feature.
* when both reload and swap are enabled then CC0/CC1/PERIOD/DT values are swapped with CC_BUFF/CC1_BUFF/PERIOD_BUFF/DT_BUFF values respectively
* When only reload is enabled then CC_BUFF/CC1_BUFF/PERIOD_BUFF/DT_BUFF values are copied to CC0/CC1/PERIOD/DT respectively.
* There is no action when reload is disabled.
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_EnableSwap(TCPWM_Type *base, uint32_t cntNum,  bool enable)
{
    Cy_TCPWM_Block_EnableSwap(base, cntNum, enable);
}

