PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_pwm.h
/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_Set_KillLinePolarity
****************************************************************************//**
*
* Configures the source for the output signal "line_out"  and "line_compl_out"
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param kill_line_polarity
* Kill Line polarity value \ref cy_en_kill_line_polarity_t
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_Set_KillLinePolarity(TCPWM_Type *base, uint32_t cntNum,  cy_en_kill_line_polarity_t kill_line_polarity)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);

    TCPWM_GRP_CNT_CTRL(base, grp, cntNum) &= ~TCPWM_GRP_CNT_CTRL_KILL_LINE_POLARITY_Msk;
    TCPWM_GRP_CNT_CTRL(base, grp, cntNum) |= (_VAL2FLD(TCPWM_GRP_CNT_CTRL_KILL_LINE_POLARITY, kill_line_polarity));
}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_PWMDeadTimeBuff
****************************************************************************//**
*
* Writes the dead time buffered value for PWM. This is the number of clock cycles of dead time to activate Line Out
* Data from DT_BUFF will be shallow transferred to DT (when swap enable is disabled) on a terminal count event with an actively pending switch event.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param deadTime
* The dead time value.
*
* \funcusage
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_PWM_PWMDeadTime
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_PWMDeadTimeBuff(TCPWM_Type const *base, uint32_t cntNum, uint32_t deadTime)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);
    uint32_t result = TCPWM_GRP_CNT_DT_BUFF(base, grp, cntNum);
    result &= ~(TCPWM_GRP_CNT_DT_BUFF_DT_LINE_OUT_L_Msk | TCPWM_GRP_CNT_DT_BUFF_DT_LINE_OUT_H_Msk);

    TCPWM_GRP_CNT_DT_BUFF(base, grp, cntNum) = result |
        (_VAL2FLD(TCPWM_GRP_CNT_DT_BUFF_DT_LINE_OUT_L, (uint8_t)(deadTime)) |
         _VAL2FLD(TCPWM_GRP_CNT_DT_BUFF_DT_LINE_OUT_H, (uint8_t)(deadTime >> 8)));

}

/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_PWMDeadTimeBuffN
****************************************************************************//**
*
* Writes the dead time buffered value for PWM. This is the number of clock cycles of dead time to activate Line Compliment Out
* Data from DT_BUFF will be shallow transferred to DT (when swap enable is disabled) on a terminal count event with an actively pending switch event.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param deadTime
* The dead time value.
*
* \funcusage
* \snippet tcpwm/pwm/snippet/main.c snippet_Cy_TCPWM_PWM_PWMDeadTime
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_PWMDeadTimeBuffN(TCPWM_Type const *base, uint32_t cntNum, uint32_t deadTime)
{
    uint32_t result;
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);

    result = TCPWM_GRP_CNT_DT_BUFF(base, grp, cntNum);
    result &= ~(TCPWM_GRP_CNT_V2_DT_DT_LINE_COMPL_OUT_Msk);

    TCPWM_GRP_CNT_DT_BUFF(base, grp, cntNum) = result |
        _VAL2FLD(TCPWM_GRP_CNT_V2_DT_DT_LINE_COMPL_OUT, (uint16_t)(deadTime));

}


/*******************************************************************************
* Function Name: Cy_TCPWM_PWM_SetDTBuff
****************************************************************************//**
*
* Writes the dead time buffered value for PWM. This is the number of clock cycles of dead time to activate Line Out and  Line Compliment Out
* Data from DT_BUFF will be shallow transferred to DT (when swap enable is disabled) on a terminal count event with an actively pending switch event.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param deadTime
* The dead time value for both Line Out and Line Compliment Out.
*
* \note 32 bit value with 0-15 bits to set Line out Dead Time value and 16-31 bits to set Line Compliment Out Dead Time Value.
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_PWM_SetDTBuff(TCPWM_Type const *base, uint32_t cntNum, uint32_t deadTime)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);
    TCPWM_GRP_CNT_DT_BUFF(base, grp, cntNum) = deadTime;
}

#endif /* defined (CY_IP_MXS40TCPWM) */

/** \} group_tcpwm_functions_pwm */

/** \} group_tcpwm_pwm */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXTCPWM */

#endif /* CY_TCPWM_PWM_H */

/* [] END OF FILE */
